Revit 2018 API
RebarConstraintsManager.AllowConstraintTargets Method
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public bool AllowConstraintTargets(
	RebarConstrainedHandle handle,
	IList<Reference> targetsToConstrain
)
Visual Basic
Public Function AllowConstraintTargets ( _
	handle As RebarConstrainedHandle, _
	targetsToConstrain As IList(Of Reference) _
) As Boolean
Visual C++
public:
bool AllowConstraintTargets(
	RebarConstrainedHandle^ handle,
	IList<Reference^>^ targetsToConstrain
)
Parameters
handle
Type: Autodesk.Revit.DB.Structure.RebarConstrainedHandle
targetsToConstrain
Type: System.Collections.Generic.IList<Reference>
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace